In [1]:
# Module Imports
import mariadb
import sys

# Connect to MariaDB Platform
try:
    conn = mariadb.connect(
        user="root",
        password="--------",
        host="172.17.0.2",
        port=3306,
        database="employees"
    )
except mariadb.Error as e:
    print(f"Error connecting to MariaDB Platform: {e}")
    sys.exit(1)
# Get Cursor
cur = conn.cursor()

In [2]:
cur.execute(
    '''select employees.first_name, employees.last_name, salaries.salary, salaries.to_date from employees 
       inner join salaries on employees.emp_no = salaries.emp_no LIMIT 50000;''')

In [3]:
main_lst = []
for allthem in cur:
    element_list = []
    for element in allthem:
        element_list.append(element)
    main_lst.append(element_list)

In [4]:
len(main_lst)

50000

In [5]:
import pandas as pd

In [6]:
columns = ['first_name', 'last_name', 'salary', 'to_date']
df = pd.DataFrame(main_lst, columns = columns)

In [7]:
df.iloc[0:1000]

    first_name  last_name  salary     to_date
0       Georgi    Facello   60117  1987-06-26
1       Georgi    Facello   62102  1988-06-25
2       Georgi    Facello   66074  1989-06-25
3       Georgi    Facello   66596  1990-06-25
4       Georgi    Facello   66961  1991-06-25
..         ...        ...     ...         ...
995   Hironobu  Haraldson   70464  1999-09-18
996   Hironobu  Haraldson   72343  2000-09-17
997   Hironobu  Haraldson   74365  2001-09-17
998   Hironobu  Haraldson   74957  9999-01-01
999      Perla     Heyers   66591  1999-10-14

[1000 rows x 4 columns]